# 7. Select Data (loc)
Select w and column using the name

In [3]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Sib. #')
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [4]:
df.loc['1st'] # bring data from index '1st'

name        Sally
school      Biola
height        157
English        97
Math           89
Science        88
SWskills      C++
Name: 1st, dtype: object

In [5]:
df.loc['1st', 'English'] # index = 1st and column = English

97

In [6]:
df.loc[['1st', '2nd'], 'English']

Sib. #
1st    97
2nd    78
Name: English, dtype: int64

In [7]:
df.loc['1st':'2nd', 'English':'Science']

        English  Math  Science
Sib. #
1st          97    89       88
2nd          78   100       98